# Remove Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerTable..::..Remove Method
ExportLayerTable Class See Also
---
Removes the pair (key, info) by pattern key.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void Remove(
	ExportLayerKey exportLayerKey
)
```

Visual Basic
---
```text
Public Sub Remove ( _
	exportLayerKey As ExportLayerKey _
)
```

Visual C++
---
```text
public:
void Remove(
	ExportLayerKey^ exportLayerKey
)
```

# ### Parameters
exportLayerKey
    Type: Autodesk.Revit.DB..::..ExportLayerKey The export pattern key.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportLayerTable Class
Autodesk.Revit.DB Namespace